courtPO/app/controllers/cases_controller.rb

SELECT "cases".* FROM "cases"
---
  def index
    @cases = Case.all

INSERT INTO "cases" ("conflict", "created_at", "expiration", "is_resolved", "summary", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @case = Case.new(params[:case])
    @case.user = current_user
      if @case.save

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def edit
    @case = Case.find(params[:id])

DELETE FROM "cases" WHERE "cases"."id" = $1  [["id", 3]]
SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def destroy
    Case.find(params[:id]).destroy

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "cases" SET "summary" = 'wow', "updated_at" = '2013-11-11 19:06:27.429606' WHERE "cases"."id" = 4
---
  def update
    @case = Case.find(params[:id])
      if @case.update_attributes(params[:case])

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    id = (params[:id])
    @case = Case.find(id)
    @user = User.find(@case.user_id)