courtPO/app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = '459542592' LIMIT 1
SELECT COUNT(*) FROM "users" WHERE "users"."uid" = '459542592'
INSERT INTO "users" ("created_at", "email", "image", "name", "nickname", "num_best_solutions", "password_digest", "provider", "score_total", "twitter", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    auth_hash = request.env['omniauth.auth']
    binding.pry
    if User.where(:uid => auth_hash["uid"]).empty?
      @user = User.new
      @user.uid = auth_hash["uid"]
      @user.name = auth_hash["info"]["nickname"]
      @user.image = auth_hash["info"]["image"]
      @user.save