courtPO/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "num_best_solutions", "num_cases", "password_digest", "score_total", "twitter", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save