courtPO/app/views/users/show.html.erb

SELECT "solutions".* FROM "solutions" WHERE "solutions"."user_id" = 7
---

<% @user.solutions.each do |solution| %>