courtPO/app/views/cases/index.html.erb

SELECT "solutions".* FROM "solutions" WHERE "solutions"."case_id" = 19
---
      <ul id="<%=case_doc.id%>" >
      <% case_doc.solutions.each do |opinion| %>