courtPO/app/views/cases/show.html.erb

    <div>
    <% @case.solutions.each do |solution| %>
---
SELECT "solutions".* FROM "solutions" WHERE "solutions"."case_id" = 15