app/views/cases/show.html.erb

SELECT "solutions".* FROM "solutions" WHERE "solutions"."case_id" = 4
---

    <% @case.solutions.each do |solution| %>

SELECT "cases".* FROM "cases" WHERE "cases"."user_id" = 4 AND "cases"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "cases" WHERE "cases"."user_id" = 4 AND "cases"."id" = 1
---
<% if current_user  %>
    <% unless current_user.cases.where(id: params[:id]).empty? %>