app/views/users/show.html.erb

SELECT "cases".* FROM "cases" WHERE "cases"."user_id" = 4
---
<div id="case">
<% @user.cases.each do |cased| %>

SELECT "solutions".* FROM "solutions" WHERE "solutions"."user_id" = 1
---
<div id="user-solutions">
  <% @user.solutions.each do |solution| %>