app/controllers/cases_controller.rb

SELECT "cases".* FROM "cases"
---
  def index
    @cases = Case.all

INSERT INTO "cases" ("conflict", "created_at", "expiration", "is_resolved", "summary", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @case = Case.new(params[:case])
    @case.user = current_user
      if @case.save

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @case = Case.find(params[:id])

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "cases" SET "title" = 'Problem with my Roommate2', "updated_at" = '2013-11-13 23:15:36.983531' WHERE "cases"."id" = 1
---
  def update
    @case = Case.find(params[:id])
      if @case.update_attributes(params[:case])

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "13"]]
---
  def show
    id = (params[:id])
    @case = Case.find(id)