app/controllers/session_controller.rb

  def create
    auth_hash = request.env['omniauth.auth']
    if User.where(:uid => auth_hash["uid"]).empty?
      @user = User.new
      @user.uid = auth_hash["uid"]
      @user.name = auth_hash["info"]["nickname"]
      @user.image = auth_hash["info"]["image"]
      @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "99201913"]]
SELECT COUNT(*) FROM "users" WHERE "users"."uid" = '99201913'
INSERT INTO "users" ("created_at", "email", "image", "name", "nickname", "num_best_solutions", "password_digest", "provider", "score_total", "twitter", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"