app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "num_best_solutions", "num_cases", "password_digest", "score_total", "twitter", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    @case = Case.all
    @solution = Solution.all
    @user = User.find(params[:id])
---
SELECT "cases".* FROM "cases" WHERE "cases"."user_id" = 4
SELECT "solutions".* FROM "solutions" WHERE "solutions"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]